package/webui/files/var/www/onvif/wsd_files/Bye.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
                   xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
                   xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
                   xmlns:tdn="http://www.onvif.org/ver10/network/wsdl">
    <SOAP-ENV:Header>
        <wsa:MessageID>uuid:%MSG_UUID%</wsa:MessageID>
        <wsa:ReplyTo SOAP-ENV:mustUnderstand="true">
            <wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
        </wsa:ReplyTo>
        <wsa:To SOAP-ENV:mustUnderstand="true">urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
        <wsa:Action SOAP-ENV:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2005/04/discovery/Bye</wsa:Action>
        <wsdd:AppSequence InstanceId="0"
                          MessageNumber="%MSG_NUMBER%"/>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <wsdd:Bye>
            <wsa:EndpointReference>
                <wsa:Address>urn:uuid:%UUID%</wsa:Address>
            </wsa:EndpointReference>
            <wsdd:Types>tdn:NetworkVideoTransmitter</wsdd:Types>
            <wsdd:Scopes>onvif://www.onvif.org/type/video_encoder onvif://www.onvif.org/type/audio_encoder onvif://www.onvif.org/type/ptz onvif://www.onvif.org/hardware/%HARDWARE% onvif://www.onvif.org/name/%NAME% onvif://www.onvif.org/location/anywhere</wsdd:Scopes>
            <wsdd:XAddrs>%ADDRESS%</wsdd:XAddrs>
            <wsdd:MetadataVersion>0</wsdd:MetadataVersion>
        </wsdd:Bye>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
